index=main earliest=-25h sourcetype="WinEventLog:Microsoft-Windows-Sysmon/Operational" ("EventCode=22" AND "QueryResults*") OR ("EventCode=3" AND "DestinationIp*") NOT (QueryResults="10.*" OR QueryResults="172.16.*" OR QueryResults="192.168.*") NOT (DestinationIp="10.*" OR DestinationIp="172.16.*" OR DestinationIp="192.168.*") | table ComputerName,Image,DestinationIp,QueryResults

